app/views/businesses/_form.html.erb

SELECT "business_types".* FROM "business_types"
---
            <div class="select is-primary">
              <%= collection_select(:business, :business_type_id, BusinessType.all, :id, :name, :prompt => 'Seleccione un tipo de negocio') %>

SELECT "statuses".* FROM "statuses" WHERE (active = true and status_type_id = 3)
---
    geocoder = new google.maps.Geocoder();
    geocoder.geocode({
      latLng: pos
    },
    function(results, status){
      if (status == google.maps.GeocoderStatus.OK){
        $("#latInput").val("OK")
        var place = results[0];
        for (var i = 0; i < place.address_components.length; i++) {
          for (var j = 0; j < place.address_components[i].types.length; j++) {
            console.log("Tipos: "+place.address_components[i].types[j]+", Valor: "+ place.address_components[i].long_name)
            if (place.address_components[i].types[j] == "route") {
              $('#calleInput').val(place.address_components[i].long_name);
            }
            if (place.address_components[i].types[j] == "street_number") {
              $('#numExtInput').val(place.address_components[i].long_name);
            }
            if (place.address_components[i].types[j] == "sublocality") {
              $('#coloniaInput').val(place.address_components[i].long_name);
            }
            if (place.address_components[i].types[j] == "administrative_area_level_2") {
              $('#municipioInput').val(place.address_components[i].long_name);