app/controllers/businesses_controller.rb

SELECT  "businesses".* FROM "businesses" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "businesses"
---
  def index
    #Variables de clase inciian con @ (vista y controller)
    #@businesses = Business.all
    @businesses = Business.paginate(:page => params[:page], :per_page => 10)

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @business = Business.find(params[:id])

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @business = Business.find(params[:id])

INSERT INTO "businesses" ("name", "slogan", "description", "business_type_id", "status_id", "cover_file_name", "cover_content_type", "cover_file_size", "cover_updated_at", "address_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @business = Business.new(business_params)
    #validaciones
    if @business.valid?
      @business.save

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "businesses" WHERE "businesses"."id" = $1  [["id", 1]]
---
  def destroy
    @business = Business.find(params[:id])
    @business.destroy

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "businesses" SET "cover_file_name" = $1, "cover_file_size" = $2, "cover_updated_at" = $3, "updated_at" = $4 WHERE "businesses"."id" = $5  [["cover_file_name", "ensalada.jpeg"], ["cover_file_size", 24741], ["cover_updated_at", "2017-11-04 00:10:18.552907"], ["updated_at", "2017-11-04 00:10:18.864905"], ["id", 19]]
---
  def update
    @business = Business.find(params[:id])
    if @business.update(business_params)